// 1.express模块
    // express模块是什么呢？
    // 代替http模块轻量级的web应用模块
    // 用它我们就可以不用http了
    // 为什么呢？
    // 因为http，你在搭建一些web服务器的时候
    // 很多路由操作
    // 我们要自己手动去判断，挺麻烦的
    // express在这个方面上呢，要稍微简化一点。

// 2.MongoDB
    // MongoDB是干嘛用的呢，其实就是一个数据库
    // 这个数据库，我们要了解数据的一些概念性的东西

// 3.mongose
    // 我们在node里面来操作MongoDB数据库
    // 用的中间件是谁呢？
    // 用的就是mongose这么一个东西

// 4.安装一下MongoDB环境
// 5.安装一下mongose这个第三方的中间件

// 6.数据加密（MD5）模块
    // 这个模块，我们会挑一个很典型的加密手段
    // 叫做（MD5）
    // 就是会了MD5之后呢，后面的一些***加密手段我们都要会的
    // 就是MD5是一个典型章节
    // 一些MD5的应用场景也会介绍到
// 7.讲讲数据接口编写指南
    // 然后接着这个数据接口编写
    // 回去完成一个实例
    // 类似于一个新浪微博的服务器
    // 新浪微博这个服务器有什么能力呢
    // 第一接收用户发上去的微博信息
    // 然后就是我们有查询整库的能力
    // 把这个库里面的所有数据全部查询出来的能力

    // 第三呢，还要有一个删除这个数据库，删除某一条信息的能力
    // 这个是我们做的一个微博服务接口的小示例。

    // 接下来的内容大约就是这么多!!

    // 后面的重点是MongoDB
        // 然后MongoDB的重点是mongose这一块
        // 它是一个重点，但不是一个难点

        // 难点呢，难点呢就是MongoDB的一些概念性的东西
        // 



