
// express是什么东西呢？
    // express就是node的一个第三方模块
    // 就是说到第三方模块，大家需要跟系统模块区分开来
    // 就是系统模块，你是可以直接引入使用的
    // 而第三方模块是我们要手动下载安装的

    // 怎么下载安装呢,在node环境中输入："npm install 模块名"
    // 就可以下载安装了

    // express第三方模块跟http功能类似
    // 注意是类似
    // 但是不完全一样
    // 这个express，你可以看作是一个简化版的http模块

    // 它让我们搭建一个web应用服务器，做到了极简
    // 尽量少的代码，来搭建一个功能尽量齐全的web服务器
    // 然后它，主要用来做什么呢？
    // 它主要用来，主要用来做路由
    // 但是，不仅可以做路由

    // 还可以拥有什么功能，像是cookie，cookie数据
    // 还有像什么中间件等等
    // 它都可以具备的，具备这些功能的

    // 然后，它有一个问题
    // 它是一个第三方的，所以我们在使用之前，必须手动安装
    // 我们在手动装这个东西的时候

    // 会用两种方式去装express
    // 第一种方式是，本地文件方式去安装
    // 第二种方式是，全局安装。

    // 两种方式都会学到

    // 就是现在express模块，现在开启了这么一个模块
    // express的维护团队现在又研发了一个模块叫做KOA
    // 现在这个KOA已经更新到了2.0了
    // 它是未来，就是ES6，ES7时代里面，它会使用的一个模块

    // 这个KOA，他们会拿这个去替代express
    // 在以后的ES7普及的时候，这个express可能就没什么人用了

    // 接下来会讲讲express的安装方式
    // 在你的项目文件夹下执行控制台命令"npm install express"
    // 该命令执行完毕后，会在node_modules文件出现相关的模块文件
    // 这个是局部安装，什么是局部安装呢？
    // 就是你只能在当前文件夹下使用express模块
    
    // 还有一种安装方式呢是全局安装
    // 其实全局安装，就是把这个模块安装在根路径下
    // 如果你把这个模块装成全局的话
    // 在你的电脑上任何一个地方调用express模块
    // 都是没有问题的

    // 下面来学习安装express的安装 ****


